Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
#include <AsyncTCP.h>           // AsyncTCP library
#include <ESPAsyncWebServer.h>  // ESPAsyncWebServer library

//#include <AsyncWebSocket.h> in the future chance the one bellow by this one
#include <LittleFS.h>          // LittleFS library
#include <WebSocketsServer.h>  // WebSockets library
#include <WiFi.h>              // WiFi library
#include <esp_task_wdt.h>

#include "esp32-hal-log.h"
#include "mbedtls/base64.h"  //Base64 é uma forma de representar dados binários (como bytes ou ficheiros) em texto ASCII seguro.

/*
-----------------------------------------
VARIABLES & CONSTANTS
-----------------------------------------*/
#define PCEsp Serial0    // If using ESP32-S2, write Serial0, if using lolin, write Serial in the file `HardwareSerial.cpp` or else an erro will show up.
#define ESPMain Serial1  // serial1 é a que vai ligar à mainframe.
#define RxSerial1 18     // para uart nos pinos, é necessário iundicar os pinos.
#define TxSerial1 17

#define XON 0x11   // Represents the byte "DC1".
#define XOFF 0x13  // Represents the byte "DC3".

const uint16_t WEBSOCKET_PORT = 81;          // Porta do WebSocket
const uint16_t HTTP_PORT = 80;               // Porta do servidor HTTP
WebSocketsServer webSocket(WEBSOCKET_PORT);  // Inicializa o servidor WebSocket na porta 81
AsyncWebServer server(HTTP_PORT);            // Inicializa o servidor HTTP na porta 80

// Definições de pinos para LEDs RGB
#define redLED 41
#define greenLED 2
#define blueLED 1
// Canais PWM (0–15 disponíveis no ESP32-S2)
#define redChannel 0
#define greenChannel 1
#define blueChannel 2
// Resolução e frequência PWM
#define pwmFreq 1000
#define pwmResBits 8  // 8 bits = valores de 0 a 255

// Nivel do ESP32 HAL log: v, d, i, w, e
#define WARNING(msg, ...) log_w(msg, ##__VA_ARGS__)
#define ERRO(msg, ...) log_e(msg, ##__VA_ARGS__)
#define INFO(msg, ...) log_i(msg, ##__VA_ARGS__)
#define DEBUG(msg, ...) log_d(msg, ##__VA_ARGS__)
#define VERBOSE(msg, ...) log_v(msg, ##__VA_ARGS__)

/**
 * @brief Variáveis globais e funções.
 * @author M.V.
 * @date 2025-08-24
 */
namespace SystemVarFuncMV {
  // Variaveis para armazenar a mensagem recebida da mainframe
  const size_t MAX_MSG_SIZE = 300;
  uint8_t rxBuffer[MAX_MSG_SIZE];
  size_t rxLen = 0;

  enum ErrorType {
    UNKNOWN = 0,
    LITTLEFS_MAINFILES,
    HTTP,
    BASE64,
  };
  enum ErrorDomain {
    SYSTEM_ERROR,  // erros no próprio ESP32, comunicação, memória, etc.
    ROBOT_ERROR    // erros robo obtidos por comunicação
  };
  enum ErrorLevel {
    VERBOSE,  // Muito detalhe
    DEBUG,    // Debug normal
    INFO,     // Informação
    WARNING,  // Aviso
    CRITICAL
  };
}  // namespace SystemVarFuncMV

/**
 * @brief Variáveis referentes ao Access Point e aos clientes.
 * @author M.V.
 * @date 2025-07-14
 */
namespace clientManagerMV {
  // Configuração do Access Point (AP)
  const char* ap_ssid = "Scorbot-ER VII AP";  // Nome do Access Point (SSID)
  const char* ap_password = "123456789";      // Senha do Access Point (senha)

  bool canSendCommands = true;  // If true a command can be sended to the mainframe, if false, the command keep in waiting until XON is received.

  constexpr int MAX_NOME_LENGTH = 25;           // Máximo de caracteres para o nome do usuário.
  constexpr const char ADMIN_PASSWORD[] = "1";  // Senha correta de Admin.

  const uint8_t MAX_ADMIN = 1;  // Número máximo de administradores
  uint8_t adminCount = 0;       // Contador atual de administradores conectados
  uint8_t adminId = 255;        // ID do administrador atual (255 = nenhum admin atribuído)

  const uint8_t MAX_USER = 1;  // Número máximo permitido de utilizadores normais
  uint8_t usercount = 0;       // Contador atual de utilizadores conectados
  uint8_t userId = 255;        // ID do utilizador atual (255 = nenhum user atribuído)

  struct Cliente {
    uint8_t id;                           // ID único para o usuário
    bool isAdmin;                         // Se é ADM ou não
    bool isUser;                          // Se é USER ou não
    IPAddress ip;                         // IP do cliente
    bool conectado;                       // Status de conexão (conectado/desconectado)
    char nome[MAX_NOME_LENGTH];           // Nome do usuário armazenado como uma string de caracteres
    unsigned long startConnectionMillis;  // Momento em que se conectou
    unsigned long lastPingMillis;         // Momento do último ping enviado

    // Constructor to start the client with default values.
    Cliente() : id(255), isAdmin(false), isUser(false), conectado(false), startConnectionMillis(0), lastPingMillis(0) { memset(nome, 0, MAX_NOME_LENGTH); }
  };
  Cliente clients[WEBSOCKETS_SERVER_CLIENT_MAX];  // Array para armazenar os clientes conectados
}  // namespace clientManagerMV

/**
 * @brief Variáveis e funções referentes aos `ValoresDoRobo`, à lista de comandos `commandBacklog` e à lista de mensagens `pendingMessages`.
 * @author M.V.
 * @date 2025-07-14
 */
namespace robotValuesMV {
  struct ValoresDoRobo {
    int coordenadas[5], encoders[5];  // (5int+5int) * 4bytes = 40 Bytes
    uint16_t inState, outState;       // (16bits + 16bits = 4Bytes)

    ValoresDoRobo() : coordenadas{0, 0, 0, 0, 0}, encoders{0, 0, 0, 0, 0}, inState(0b0000000000000000), outState(0b0000000000000000) {}
  };
  ValoresDoRobo valoresAcessiveis;

  bool isQueueFull(uint8_t queueStart, uint8_t queueEnd, uint8_t maxQueueSize) {
    return ((queueEnd + 1) % maxQueueSize) == queueStart;
  }
  bool isQueueEmpty(uint8_t queueStart, uint8_t queueEnd) {
    return queueStart == queueEnd;
  }

  // lista de comandos que precisam de ser armazenados para saber a que comando pertence a resposta
  constexpr uint8_t MAX_NUMBER_OF_COMMANDS_IN_QUEUE = 4;
  enum commandType { NONE = 0, SHOW_DIN = 1, SHOW_DOUT = 2 };
  commandType commandBacklog[MAX_NUMBER_OF_COMMANDS_IN_QUEUE];
  uint8_t queueStartCBL = 0;
  uint8_t queueEndCBL = 0;

  // Obtem o comando da lista commandBacklog mais recente, e remove-o da fila.
  commandType obterProximoComandoDaFila() {
    if (isQueueEmpty(queueStartCBL, queueEndCBL)) return NONE;

