Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
    commandType cmd = commandBacklog[queueStartCBL];
    queueStartCBL = (queueStartCBL + 1) % MAX_NUMBER_OF_COMMANDS_IN_QUEUE;
    return cmd;
  }

  constexpr size_t MAX_MSG_LENGTH = 64;                    // max caracteres por mensagem (inclui '\0')
  constexpr uint8_t MAX_PENDING_MSGS = 15;                 // capacidade da fila
  char pendingMessages[MAX_PENDING_MSGS][MAX_MSG_LENGTH];  // fila de mensagens, 1º[numero maximo de espaços disponiveis],2º [numero maximo de bytes que pode conter]
  uint8_t queueStartPM = 0;                                // índice de leitura
  uint8_t queueEndPM = 0;                                  // índice de escrita

  enum listType { CHAR_PM = 0, COMMAND_TYPES = 1 };
  /**
 * @author M.V.
 * @date 2025-07-14
 * @brief Adiciona um comando ou mensagem na fila especifica. Esta função  verifica se a fila está cheia e, se não estiver, adiciona o comando ou a
 * mensagem na fila correta com base no tipo. Esta função é modular para listas circulares.
 *
 * @param type O tipo da lista/fila onde será inserido:
 *             - Use CHAR_PM para a fila de mensagens pendentes (char[15][64])
 *             - Use COMMAND_TYPES para a fila de comandos (commandBacklog).
 * @param cmd O comando a ser adicionado na fila (somente usado se type == COMMAND_TYPES), caso não seja esse use 'robotValuesMV::commandType::NONE',nunca nullptr.
 * @param mensagem Texto a ser adicionado à fila de mensagens (somente usado se type == CHAR_PM), caso contrario use nullptr.
 * @param queueStart Referência ao índice de início da fila (usado para verificação).
 * @param queueEnd Referência ao índice de fim da fila; será atualizado após a inserção.
 * @param maxQueueSize Tamanho máximo da fila (usado no controle circular).
 * @example
 * Para a lista commandBacklog: adicionarComandoNaFila(SHOW_DIN, nullptr, COMMAND_TYPES, queueStartCBL, queueEndCBL, MAX_NUMBER_OF_COMMANDS_IN_QUEUE);
 * Para a lista pendingMessages: adicionarComandoNaFila(NONE, "mensagem recebida", CHAR_PM, queueStartPSC, queueEndPSC, MAX_PENDING_MSGS);
 * @note se for para a lista pendingMessages, é possivel colocar qualquer valor em 'cmd' pois essa lista é intocável in case of CHAR_PM
 * @return true Se o item foi adicionado com sucesso. false Se a fila estava cheia ou tipo inválido.
 */
  bool adicionarComandoNaFila(listType type, commandType cmd, const char* msg, uint8_t& queueStart, uint8_t& queueEnd, uint8_t maxQueueSize) {
    if (isQueueFull(queueStart, queueEnd, maxQueueSize)) {
      ERRO("Full queue.");
      return false;
    }

    switch (type) {
      case CHAR_PM:
        if (strlen(msg) >= MAX_MSG_LENGTH) {
          // Mensagem muito grande: envia imediatamente para o mainframe e não adiciona à fila
          WARNING("Mensagem excedeu o limite e será enviada imediatamente");
          ESPMain.write((const uint8_t*)msg, strlen(msg));
          return true;
        }
        // Copiar só até MAX_MSG_LENGTH - 1 e forçar o '\0'
        strncpy(pendingMessages[queueEnd], msg, MAX_MSG_LENGTH - 1);
        pendingMessages[queueEnd][MAX_MSG_LENGTH - 1] = '\0';  // Garante terminação
        // Atualizar queueEnd também aqui!
        queueEnd = (queueEnd + 1) % maxQueueSize;
        break;

      case COMMAND_TYPES:
        commandBacklog[queueEnd] = cmd;
        queueEnd = (queueEnd + 1) % maxQueueSize;
        break;

      default: ERRO("[ERRO] Tipo de fila desconhecido."); return false;
    }
    return true;
  }

}  // namespace robotValuesMV

/**
 * @brief Contem as variaveis referentes ao tempo(millis).
 * @author M.V.
 * @date 2025-07-14
 *
 * @note A maioria é usada no `void loop()`.
 */
namespace variaveisMillisMV {
  unsigned long agora;  // Variável para armazenar o tempo atual

  const unsigned long MAX_SESSION_TIME = 60 * 60 * 1000UL;      // 60 minutos em milissegundos
  unsigned long lastCheckTimeout = 0;                           // Última vez que a verificação foi feita
  const unsigned long checkTimeoutInterval = 17 * 60 * 1000UL;  // Intervalo de 17 minutos (1 200 000 ms)

  unsigned long anteriorDebug = 0;           // Variável para armazenar o tempo anterior do debug
  const unsigned long intervaloDebug = 500;  // Intervalo de 0,5 segundos para o debug

  unsigned long lastPingTime = 0;  // Tempo do último envio de ping
  unsigned long lastPingCheck = 0;
  const unsigned long pingInterval = 30000;                  // Intervalo de 30 segundos para enviar pings
  const unsigned long pongTimeout = 20000;                   // Tempo limite de 20 segundos para resposta de pong
  bool pongPending[WEBSOCKETS_SERVER_CLIENT_MAX] = {false};  // Rastreamento de pongs pendentes

  const unsigned long intervaloMainframe = 200;
  unsigned long lastSerial1Read = 0;

  const unsigned long intervaloEntreComandosPedentes = 1000;
  unsigned long lastTimeCommandWasSended = 0;

  unsigned long rxStartTime = 0;
  const unsigned long RX_TIMEOUT = 300;  // ms (ajusta conforme necessário)

}  // namespace variaveisMillisMV

/*
-----------------------------------------
FUNCTION DECLARATIONS
-----------------------------------------*/
// void listarRedesWiFi();
// const char *traduzirEncriptacao(wifi_auth_mode_t tipo);

void ledRGB(uint8_t red, uint8_t green, uint8_t blue);
void sendMessageSlowly(const char* msg);
void criticalErrorMV(SystemVarFuncMV::ErrorDomain domain, SystemVarFuncMV::ErrorLevel level, SystemVarFuncMV::ErrorType tipeOfError, const char* reason = nullptr);
void desconectarCliente(uint8_t id, const char* motivo);
void verificarTimeouts();
void clientsTrullyConected();
void mostrarStatusClientes(uint8_t id, uint8_t target);
void connectToSTA(const char* ssid, const char* password);
bool startsWithIgnoreCase(const uint8_t* payload, size_t length, const char* prefix);
void updadeADMlist();
void enviarTextoParaCliente(uint8_t id, const char* texto);
void webSocketEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t length);
void mostrarInfoRedeAtual(uint8_t target);
void debbug();
void mainframe();
void sendNextPendingMessage();

