Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
/*
-----------------------------------------
FUNCTION DEFINITIONS
-----------------------------------------*/
/**
 * @author M.V.
 * @date 2025-07-14
 * @version 1.1
 * @brief Escolhe o melhor canal Wi-Fi (menos congestionado) entre 1 e 13 (Frequência 2,4GHz).
 * Realiza múltiplas varreduras de redes Wi-Fi próximas e conta quantas redes estão em cada canal. Retorna o canal com menor número de redes detectadas, * ideal para configurar o Access Point (AP). Caso não encontre nenhuma rede após todas as tentativas, retorna o valor padrão (6).
 *
 * @param tentativasMax Número máximo de tentativas de varredura (default: 5).
 * @param intervaloMs Intervalo em milissegundos entre tentativas (default: 500ms).
 * 
 * @return int Canal Wi-Fi recomendado (1 a 13).
 */
int escolherMelhorCanal(int tentativasMax = 5, int intervaloMs = 500) {
  int melhorCanal = 6;   // fallback neutro
  int channelUsage[13];  // arrey de uso por canal

  for (int tentativa = 0; tentativa < tentativasMax; tentativa++) {
    memset(channelUsage, 0, sizeof(channelUsage));  // limpa o array

    int n = WiFi.scanNetworks();  //armazena na variavel o numero de redes encontradas & internamente guarda uma lista com os valores de SSID, RSSI (força do sinal) e canal.
    // se não for encontrada um rede espera o valor contido em "intervaloMS" e salta para a proxima tentativa.
    if (n <= 0) {
      delay(intervaloMs);
      continue;
    }

    // incrementa o canal em que se encontra cada rede
    for (int i = 0; i < n; i++) {
      int ch = WiFi.channel(i);                         //retorna o canal (normalmente de 1 a 13 para 2.4 GHz) e armazena em ch.
      if (ch >= 1 && ch <= 13) channelUsage[ch - 1]++;  // se for um canal valido de 2,4GHz incrementa o valor do canal.(lembrando da indexação apartir do 0)
    }

    // Encontrar canal com menos interferência
    int minUso = channelUsage[0];
    melhorCanal = 1;
    for (int i = 1; i < 13; i++) {
      if (channelUsage[i] < minUso) {
        minUso = channelUsage[i];
        melhorCanal = i + 1;
      }
    }
    ledRGB(0, 100, 0);
    delay(1000);
    return melhorCanal;  // saiu com dados válidos
  }
  ledRGB(0, 100, 100);
  delay(1000);
  // Não encontrou nenhuma rede após todas as tentativas
  return melhorCanal;
}

void ledRGB(uint8_t red, uint8_t green, uint8_t blue) {
  ledcWrite(redChannel, red);
  ledcWrite(greenChannel, green);
  ledcWrite(blueChannel, blue);
}

void setup() {  // put your setup code here, to run once:
  delay(6000);  // delay para ser possível ver os prints do setup, obrigatório para debug
  // Configura canais PWM
  ledcSetup(redChannel, pwmFreq, pwmResBits);
  ledcSetup(greenChannel, pwmFreq, pwmResBits);
  ledcSetup(blueChannel, pwmFreq, pwmResBits);

  // Associa os canais aos pinos
  ledcAttachPin(redLED, redChannel);
  ledcAttachPin(greenLED, greenChannel);
  ledcAttachPin(blueLED, blueChannel);
  esp_task_wdt_init(10, true);

  for (int i = 0; i <= 7; i++) {  // luzes iniciais.
    switch (i) {
      case 0: ledRGB(150, 0, 0); break;      // Vermelho
      case 1: ledRGB(0, 150, 0); break;      // Verde
      case 2: ledRGB(0, 0, 155); break;      // Azul
      case 3: ledRGB(155, 155, 0); break;    // Amarelo
      case 4: ledRGB(155, 0, 155); break;    // Magenta
      case 5: ledRGB(0, 155, 155); break;    // Ciano
      case 6: ledRGB(155, 155, 155); break;  // Branco
      case 7:
        ledRGB(0, 0, 0);
        delay(200);
        break;  // Desliga tudo no fim
    }
    delay(400);
  }

  // Inicialização da Serial para depuração
  PCEsp.begin(115200);
  ESPMain.setRxBufferSize(SystemVarFuncMV::MAX_MSG_SIZE + 30);  // Increase buffer size
  ESPMain.begin(9600, SERIAL_8N1, RxSerial1, TxSerial1);        // Configura a Serial1 para comunicação com o mainframe

  // Inicialize o sistema de arquivos
  if (!LittleFS.begin()) {  // ele já contem o seu proprio log-hal
    criticalErrorMV(SystemVarFuncMV::SYSTEM_ERROR, SystemVarFuncMV::CRITICAL, SystemVarFuncMV::LITTLEFS_MAINFILES);
  }

  WiFi.mode(WIFI_STA);
  WiFi.disconnect();

  int melhorCanal = escolherMelhorCanal();                 // Guarda o melhor canal para conexão
  INFO("📶 Canal menos congestionado: %d.", melhorCanal);  //PCEsp.printf("📶 Canal menos congestionado: %d\n", melhorCanal);

  WiFi.mode(WIFI_AP_STA);  // Configurar WiFi no modo STA e AP

  /*----------------------------
  Parte do Acess Point com canal automátic
  ----------------------------*/
  WiFi.softAP(clientManagerMV::ap_ssid, clientManagerMV::ap_password, melhorCanal, 0, 4);  // inicia o AP
  VERBOSE("Access Point '%s' iniciado. IP do ESP32 (AP): %s.", clientManagerMV::ap_ssid, WiFi.softAPIP().toString().c_str());

  /*----------------------------
  Parte do servidor HTTP
  ----------------------------*/
  /* Se o server.on("/estado", …) estiver antes do serveStatic, ele apanha logo a rota e não deixa cair no fallback do LittleFS.
    Se estivesse depois, o pedido ia primeiro tentar o serveStatic → falhava → spammava o log → só depois chamava o teu handler.  */
  server.on("/favicon.ico", HTTP_GET, [](AsyncWebServerRequest* request) { request->send(204); });

  server.on("/estado", HTTP_GET, [](AsyncWebServerRequest* request) {
    char texto[80];      // coordenadas e encoders como string
    uint8_t ioBytes[4];  // binário dos IOs
    char base64IO[10];   // Base64 de 4 bytes = 8 caracteres (+ margem)
    size_t base64Len = 0;
    char respostaFinal[192];  // resposta total (texto + base64IO)

    const int* coordenadas = robotValuesMV::valoresAcessiveis.coordenadas;  // 5var * 4bytes = 20 bytes
    const int* encoders = robotValuesMV::valoresAcessiveis.encoders;        // 5var * 4bytes = 20 bytes  ao juntar os 2 dá 40 bytes | 40bytes * 8bits(1byte) = 320 bits
    uint16_t inState = robotValuesMV::valoresAcessiveis.inState;
    uint16_t outState = robotValuesMV::valoresAcessiveis.outState;  // 4bytes = 32bits, base64 gera saidas com multiplos de 4 então em vez de gerar 6 bytes, vai gerar 8bytes

    // Prepara o texto das coordenadas e encoders
    snprintf(texto,
        sizeof(texto),
        "%d,%d,%d,%d,%d;%d,%d,%d,%d,%d;",  // Total = 60 (números) + 10(separadores) + 1 ('\0') = 71 bytes (pior caso possivel -99999)
        coordenadas[0],
        coordenadas[1],
        coordenadas[2],
        coordenadas[3],
        coordenadas[4],
        encoders[0],
        encoders[1],
        encoders[2],
        encoders[3],
        encoders[4]);

