Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
    // Prepara os 4 bytes binários
    ioBytes[0] = inState >> 8;
    ioBytes[1] = inState & 0xFF;
    ioBytes[2] = outState >> 8;
    ioBytes[3] = outState & 0xFF;

    int ret = mbedtls_base64_encode((unsigned char*)base64IO, sizeof(base64IO), &base64Len, ioBytes, 4);  // Codifica os IOs em Base64
    if (ret != 0) {
      request->send(500, "text/plain", "Erro na codificação Base64");
      WARNING("Erro na codificação Base64.");
      criticalErrorMV(SystemVarFuncMV::SYSTEM_ERROR, SystemVarFuncMV::WARNING, SystemVarFuncMV::BASE64);
      return;
    }
    base64IO[base64Len] = '\0';                                               // garantir terminação nula
    snprintf(respostaFinal, sizeof(respostaFinal), "%s%s", texto, base64IO);  // Concatena texto + base64IO na resposta final
    request->send(200, "text/plain", respostaFinal);                          // Envia como texto plano
  });
  server.on("/get-comandos", HTTP_GET, [](AsyncWebServerRequest* request) {
    File file = LittleFS.open("/comandos.md", "r");
    if (!file) {
      request->send(404, "text/plain", "Ficheiro não encontrado");
      WARNING("Ficheiro 'comandos.md' não encontrado no sistema de arquivos.");
      criticalErrorMV(SystemVarFuncMV::SYSTEM_ERROR, SystemVarFuncMV::WARNING, SystemVarFuncMV::LITTLEFS_MAINFILES);
      return;
    }
    AsyncWebServerResponse* comandsFileResponse =
        request->beginResponse("text/plain", file.size(), [file](uint8_t* buffer, size_t maxLen, size_t index) mutable -> size_t { return file.read(buffer, maxLen); });
    comandsFileResponse->addHeader("Content-Disposition", "attachment; filename=comandos.md");
    request->send(comandsFileResponse);
  });

  // Página principal atualiza a página http://192.168.1.167/estado para cada requisição dos viewers
  server.serveStatic("/", LittleFS, "/webpage").setDefaultFile("index.html");
  yield();
  server.serveStatic("/html", LittleFS, "/html");
  yield();
  server.serveStatic("/css", LittleFS, "/css");
  yield();
  server.serveStatic("/js", LittleFS, "/js");
  yield();
  server.serveStatic("/fonts", LittleFS, "/fonts");
  yield();

  // Inicializa o servidor HTTP para o primeiro handshake
  server.begin();
  INFO("Servidor HTTP iniciado na porta %d.", HTTP_PORT);  //  PCEsp.println(F("Servidor HTTP iniciado na porta 80."));

  /*----------------------------
  Parte do servidor WEBSOCKET
  ----------------------------*/
  // Inicializa o WebSocket para comunicação em tempo real
  webSocket.begin();
  INFO("Servidor WebSocket iniciado na porta %d.", WEBSOCKET_PORT);
  webSocket.onEvent(webSocketEvent);  // define a função de callback para eventos do WebSocket
}

// de vez em quando mede o tempo que demora cada função a ser executada, para ver se existe alguma que demora mais do que deve.
void loop() {  // put your main code here, to run repeatedly:
  variaveisMillisMV::agora = millis();

  webSocket.loop();

  if (variaveisMillisMV::agora - variaveisMillisMV::anteriorDebug >= variaveisMillisMV::intervaloDebug) {
    variaveisMillisMV::anteriorDebug = variaveisMillisMV::agora;
    debbug();
  }
  if (variaveisMillisMV::agora - variaveisMillisMV::lastCheckTimeout >= variaveisMillisMV::checkTimeoutInterval) {
    variaveisMillisMV::lastCheckTimeout = variaveisMillisMV::agora;
    verificarTimeouts();
  }
  if (variaveisMillisMV::agora - variaveisMillisMV::lastPingCheck >= variaveisMillisMV::pongTimeout) {
    variaveisMillisMV::lastPingCheck = variaveisMillisMV::agora;
    clientsTrullyConected();
  }
  if (variaveisMillisMV::agora - variaveisMillisMV::lastSerial1Read >= variaveisMillisMV::intervaloMainframe) {
    variaveisMillisMV::lastSerial1Read = variaveisMillisMV::agora;
    mainframe();
  }
  if (variaveisMillisMV::agora - variaveisMillisMV::lastTimeCommandWasSended >= variaveisMillisMV::intervaloEntreComandosPedentes && clientManagerMV::canSendCommands) {
    variaveisMillisMV::lastTimeCommandWasSended = variaveisMillisMV::agora;
    sendNextPendingMessage();
  }
}

void sendNextPendingMessage() {
  if (robotValuesMV::isQueueEmpty(robotValuesMV::queueStartPM, robotValuesMV::queueEndPM)) return;

  const char* msg = robotValuesMV::pendingMessages[robotValuesMV::queueStartPM];
  sendMessageSlowly(msg);

  // Avança a fila após envio
  robotValuesMV::queueStartPM = (robotValuesMV::queueStartPM + 1) % robotValuesMV::MAX_PENDING_MSGS;
}

/**
 * @author M.V.
 * @date 2025-08-21
 * @version 1.2
 * @brief Handler of internal and robot errors.
 * @param domain Tells if it's an error from the microcontroller system or from the Robot.
 * @param level Defines the severity of the error.
 * @param tipeOfError Serves to identify the root cause of the error.
 * @param reason String explaining the error (optional).
 */
void criticalErrorMV(SystemVarFuncMV::ErrorDomain domain, SystemVarFuncMV::ErrorLevel level, SystemVarFuncMV::ErrorType typeOfError, const char* reason) {
  auto emergencyStop = []() {
    const char* msg1 = "COFF\rA\r";
    sendMessageSlowly(msg1);
  };

  // --- Reações por tipo de erro ---
  switch (typeOfError) {
    case SystemVarFuncMV::LITTLEFS_MAINFILES:    // se faltar algum ficheiro é muito prigoso para o sistema inteiro e pode ser tambem para o utilizador.
      emergencyStop();                           // level = warning
      if (level == SystemVarFuncMV::CRITICAL) {  // if is missing important files, it will need to stop the whole program after the robot stop.
        for (;;) {
          ledRGB(255, 0, 0);
          delay(500);
          ledRGB(0, 0, 0);
          delay(500);
        }
      }
      break;
    default: DEBUG("Unknown erro: %s", typeOfError); break;
  }

  // --- Reações por domínio ---
  switch (domain) {
    case SystemVarFuncMV::SYSTEM_ERROR: break;
    case SystemVarFuncMV::ROBOT_ERROR: break;
    default: DEBUG("Unknown domain: %s", domain); break;
  }
}

// For debbug propose
void debbug() {
  if (PCEsp.available()) {
    String terminalPc = PCEsp.readStringUntil('\n');  // Lê até Enter
    terminalPc.trim();                                // Remove espaços e quebras de linha

    PCEsp.print("Recebido do PC: ");
    PCEsp.println(terminalPc);
    ESPMain.print(terminalPc + "\r");

    if (terminalPc.equals("clientinfo")) {  // <-- aqui são aspas duplas!
      mostrarStatusClientes(255, 1);
    }
    if (terminalPc.equals("wifiinfo")) {
      // listarRedesWiFi();
      mostrarInfoRedeAtual(0);
    }
    if (terminalPc.equals("clearlist")) {
      for (int i = 0; i < robotValuesMV::MAX_NUMBER_OF_COMMANDS_IN_QUEUE; i++) {
        robotValuesMV::commandBacklog[i] = robotValuesMV::commandType::NONE;
      }
      DEBUG(" lista de espera limpa.");
    }

    // envia para o websocket
    webSocket.broadcastTXT(terminalPc);
  }
}

/** 
 * @author M.V.
 * @date 2025-09-17
 * @version 1.1
 * @brief Function to send commands trough UArt to the controller
 *  
 */
void sendMessageSlowly(const char* msg) {
  for (int i = 0; i < robotValuesMV::MAX_MSG_LENGTH && msg[i] != '\0'; ++i) {
    ESPMain.write((uint8_t*)&msg[i], 1);
    //DEBUG("Caractere enviado: %c\n", msg[i]);
    delay(5);  // Espera Xms entre caracteres(mudado de 10ms para 5ms para ser mais rápido)
  }
  //INFO("Mensagem completa enviada: %s\n", msg);
}

/**
 * @author M.V.
 * @date 2025-07-15
 * @version 1.1
 * @brief Lê bytes da porta serial ESPMain e cria strings de textos.
 *
 * @todo none
 * @bug none
 * @details
 * Esta função contém um loop que lê 1 byte de cada vez da serial e armazena os dados em um buffer chamado `rxBuffer`. A função deteta o fluxo de controle
 * XON/XOFF, dependentdo do tipo, atualiza a variavel `canSendCommands` para permitir ou bloquear o envio de comandos. Se receber um CR espera até receber
 * um LF, se durante um intervalo de tempo não receber o LF, a mensagem é processada, o mesmo se aparecer um LF. Se estiver à espera de um LF e receber outro
 * caracteres a mensagem é processada com o CR. Se só vier um LF, a mensagem é processada. Se o buffer tiver algum dado e não aparecer uma terminação, a
 * mensagem é processada por timeout.
 */
void mainframe() {
  using namespace SystemVarFuncMV;
  // PCEsp.println(F("Entrou na função mainframe()"));
  /**
   * @fn int parseIntFrom(const char* str, size_t start, size_t end)
   * @brief Converte uma substring de uma string em inteiro.
   * @param str A string original.
   * @param start Índice inicial (inclusive).
   * @param end Índice final (exclusive).
   * @return Valor inteiro da substring.
   */
  auto parseIntFrom = [](const char* str, size_t start, size_t end) -> int {
    char temp[16];
    size_t len = end - start;
    if (len >= sizeof(temp)) len = sizeof(temp) - 1;
    strncpy(temp, str + start, len);
    temp[len] = '\0';
    return atoi(temp);
  };

  /**
   * @fn void processMessage(uint8_t* rxBuffer, size_t rxLen)
   * @brief Processa uma mensagem completa recebida na porta serial.
   * @param rxBuffer Buffer contendo a mensagem recebida.
   * @param rxLen Comprimento da mensagem recebida.
   *
   * @details
   * Mostra a mensagem completa em ASCII para o PCEsp,converte caracteres imprimiveis em '.' e ignora-os. Envia por websocket para o adm e o user (se
   * conectados). Mostra a mensagem em formato HEX no PCEsp. Procura um padrão específico "1 -> 16:" para identificar estados digitais de IOs. Se
   * encontrado, converte os bits em um array de bools e armazena no IO correspondente. Procura coordenadas e encoders na mensagem, se encontrados,
   * converte-os em inteiros e armazena nos arrays correspondentes.
   */
  auto processMessage = [&](uint8_t* rxBuffer, size_t rxLen) {
    // Print ASCII-safe version
    PCEsp.print("[RX SAFE ASCII] ");
    for (size_t i = 0; i < rxLen; ++i) {
      if (isprint(rxBuffer[i]))
        PCEsp.print((char)rxBuffer[i]);
      else
        PCEsp.print('.');
    }
    PCEsp.println();

    // Converte caracteres imprimíveis em uma string de texto
    char msgTxt[257];  // MAX_MSG_SIZE + 1 para '\0'
    size_t j = 0;
    for (size_t i = 0; i < rxLen && j < sizeof(msgTxt) - 1; ++i) {
      if (isprint(rxBuffer[i])) {
        msgTxt[j++] = rxBuffer[i];
      }
    }
    msgTxt[j] = '\0';

    // Envia para admin e user (se conectados)
    if (clientManagerMV::adminId != 255) {
      enviarTextoParaCliente(clientManagerMV::adminId, msgTxt);
    }
    if (clientManagerMV::userId != 255 && clientManagerMV::userId != clientManagerMV::adminId) {
      enviarTextoParaCliente(clientManagerMV::userId, msgTxt);
    }

    // HEX debug
    PCEsp.print("[HEX]  ");
    for (size_t i = 0; i < rxLen; ++i) {
      if (rxBuffer[i] < 0x10) PCEsp.print('0');
      PCEsp.print(rxBuffer[i], HEX);
      PCEsp.print(' ');
    }
    PCEsp.println();

    // Pattern: "1 -> 16:"
    constexpr const char pattern[] = "1 -> 16:";  // Padrão inicial com as resposta dos estados dos IOs.
    constexpr size_t patternLen = sizeof(pattern) - 1;
    size_t headerIndex = SIZE_MAX;
    if (rxLen >= patternLen) {
      for (size_t i = 0; i <= rxLen - patternLen; ++i) {
        if (memcmp(&rxBuffer[i], pattern, patternLen) == 0) {
          headerIndex = i;
          break;
        }
      }
    }
    if (headerIndex != SIZE_MAX) {
      bool digitalStates[16] = {0};
      size_t bitIndex = 0;
      size_t i = headerIndex + patternLen;                                   // i representa a posição do primeiro bit após o padrão "1 -> 16:"
      while (i < rxLen && (rxBuffer[i] == ' ' || rxBuffer[i] == '\t')) i++;  // primeiro loop para ignorar espaços vazios
      for (/*inicialização*/; i < rxLen && bitIndex < 16; ++i) {             // inicialização vazia porque já iniciou anteriormente
        if (rxBuffer[i] == '0' || rxBuffer[i] == '1') {                      // Verifica se é um bit válido
          digitalStates[bitIndex++] = (rxBuffer[i] == '1');                  // Na expreção lógica é convertido '1' para true e '0' para false
          while (i + 1 < rxLen && rxBuffer[i + 1] == ' ') i++;               // Ignora espaços após o bit
        }
      }
      if (bitIndex == 16) {                                                           // se tiver 16 bits manda armazenar nas variaveis de estados do IO correto.
        robotValuesMV::commandType cmd = robotValuesMV::obterProximoComandoDaFila();  // Obtem o comando que deu origem à resposta dos estados dos IOs.
        uint16_t value = 0;
        for (int i = 0; i < 16; i++) {
          value |= (digitalStates[i] ? 1 : 0) << (15 - i);  // |= is a bitwise OR
        }
        if (cmd == robotValuesMV::SHOW_DIN) {
          robotValuesMV::valoresAcessiveis.inState = value;
          DEBUG(" SHOW_DIN,values updated:  0x%04X | binário: ", value);
        }
        else if (cmd == robotValuesMV::SHOW_DOUT) {
          robotValuesMV::valoresAcessiveis.outState = value;
          DEBUG("SHOW_DOUT,values updated:   0x%04X | binário: ", value);
        }
        for (int i = 15; i >= 0; i--) PCEsp.print((value >> i) & 1);
        PCEsp.println();
      }
      else {
        ERRO("Número inválido de bits recebidos.");
      }
      return;
    }

