Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
    // coordenates and encoders parttern
    size_t start = 0;
    while (start < rxLen && rxBuffer[start] == ' ') start++;  // Ignora espaços em branco no início do buffer

    if (start + 1 < rxLen && isdigit(rxBuffer[start]) && rxBuffer[start + 1] == ':') {  // Verifica se a mensagem começa com um dígito seguido de ':' (ex: "1:1234")
      DEBUG("Mensagem recebida possivelmente contém encoders e coordenadas.");
      size_t i = 0;

      while (i < rxLen) {                                                       // Percorre todo o buffer recebido
        if (i + 1 < rxLen && isdigit(rxBuffer[i]) && rxBuffer[i + 1] == ':') {  // Procura padrões do tipo "N:valor" (N = dígito de 1 a 5)
          int encoderId = rxBuffer[i] - '0';                                    // Extrai o número do encoder (1 a 5)
          size_t numStart = i + 2;                                              // Posição inicial do valor numérico após ':'

          while (numStart < rxLen && rxBuffer[numStart] == ' ') numStart++;  // Ignora espaços após ':'
          size_t numEnd = numStart;

          // Avança até o próximo espaço ou fim do valor numérico ou \n ou \r
          while (numEnd < rxLen && rxBuffer[numEnd] != ' ' && rxBuffer[numEnd] != '\n' && rxBuffer[numEnd] != '\r') numEnd++;

          // Converte a substring para inteiro
          int val = parseIntFrom((const char*)rxBuffer, numStart, numEnd);
          if (encoderId >= 1 && encoderId <= 5) {  // Se o encoderId é válido, guarda o valor no array de encoders
            robotValuesMV::valoresAcessiveis.encoders[encoderId - 1] = val;
            // PCEsp.printf("[DEBUG] Encoder %d -> Valor guardado: %d\n", encoderId, val);
          }
          else {
            // PCEsp.printf("[ERRO] ID de encoder inválido: %d\n", encoderId);
          }
          i = numEnd;  // Avança o índice para depois do valor lido
          continue;    // Continua procurando outros padrões no buffer
        }
        i++;  // Avança para o próximo caractere se não encontrou padrão
      }
      return;  // Sai da função após processar todos os encoders encontrados
    }

    // Coordinates: "X:..."
    if (start + 1 < rxLen && (rxBuffer[start] == 'X' || rxBuffer[start] == 'Y' || rxBuffer[start] == 'Z' || rxBuffer[start] == 'P' || rxBuffer[start] == 'R') &&
        rxBuffer[start + 1] == ':') {
      // PCEsp.println("[DEBUG] Mensagem recebida possivelmente contém apenas coordenadas.");
      size_t i = start;
      while (i < rxLen) {
        if (i + 1 < rxLen && (rxBuffer[i] == 'X' || rxBuffer[i] == 'Y' || rxBuffer[i] == 'Z' || rxBuffer[i] == 'P' || rxBuffer[i] == 'R') && rxBuffer[i + 1] == ':') {
          char coord = rxBuffer[i];
          size_t numStart = i + 2;
          while (numStart < rxLen && (rxBuffer[numStart] == ' ' || rxBuffer[numStart] == '\t')) numStart++;
          if (numStart >= rxLen) break;
          size_t numEnd = numStart;
          if (numEnd < rxLen && rxBuffer[numEnd] == '-') numEnd++;
          while (numEnd < rxLen && rxBuffer[numEnd] >= '0' && rxBuffer[numEnd] <= '9') numEnd++;
          int coordValue = parseIntFrom((const char*)rxBuffer, numStart, numEnd);
          int index = -1;
          switch (coord) {
            case 'X': index = 0; break;
            case 'Y': index = 1; break;
            case 'Z': index = 2; break;
            case 'P': index = 3; break;
            case 'R': index = 4; break;
          }
          if (index != -1) {
            robotValuesMV::valoresAcessiveis.coordenadas[index] = coordValue;
            DEBUG("Coordenada %c -> Valor guardado: %d\n", coord, coordValue);
          }
          i = numEnd;
          while (i < rxLen && (rxBuffer[i] == ' ' || rxBuffer[i] == '\t')) i++;
          continue;
        }
        i++;
      }
      return;
    }
  };

  // ---------------------------
  // Main RX loop: lê bytes da porta serial ESPMain e processa mensagens
  // completas
  // ---------------------------
  static bool waitingForLF = false;  // True se o último byte foi \r e estamos à espera de \n

  // Lê todos os bytes disponíveis na UART e monta mensagens completas
  while (ESPMain.available()) {                                 // avaiable() retorna o número de bytes disponíveis para leitura, quando não houver mais bytes, retorna 0.
    int byteRead = ESPMain.read();                              // Lê um byte da porta serial ESPMain,quando não houver mais bytes, retorna -1.
    if (byteRead < 0) continue;                                 // Se não houver bytes disponíveis, read() retorna -1, então ignora
    if (rxLen == 0) variaveisMillisMV::rxStartTime = millis();  // Se o buffer não está vazio, marca o início da receção (para timeout)

    // Verifica se o byte lido corresponde a XON ou XOFF
    if (byteRead == XON) {
      clientManagerMV::canSendCommands = true;
      DEBUG("XON recebido, comandos podem ser enviados.");
      continue;  // Não é necessário guardar no buffer
    }
    if (byteRead == XOFF) {
      clientManagerMV::canSendCommands = false;
      DEBUG("XOFF recebido, não envia comandos até receber XON.");
      continue;  // Não é necessário guardar no buffer
    }

    // Se houver espaço no buffer...
    if (rxLen < MAX_MSG_SIZE) {
      rxBuffer[rxLen++] = static_cast<uint8_t>(byteRead);  // converte int para uint8_t e adiciona o byte ao buffer.
    }
    else {  // Se o buffer encher, limpa e avisa
      WARNING("Buffer excedido, aumenta no codigo os bytes do array.Limpo");
      rxLen = 0;
      waitingForLF = false;
      continue;
    }

    // Se está à espera de LF após CR, verifica se o byte atual é \n
    if (waitingForLF) {
      waitingForLF = false;
      if (byteRead == '\n') {  // Mensagem termina com \r\n: processa tudo
        processMessage(rxBuffer, rxLen);
        rxLen = 0;
        continue;
      }
      else {  // Mensagem termina só com \r: processa até ao \r (incluindo)
        processMessage(rxBuffer, rxLen - 1);
        rxBuffer[0] = static_cast<uint8_t>(byteRead);  // O byte atual (não-\n) inicia nova mensagem
        rxLen = 1;
        // Não faz continue, pois pode ser outro terminador
      }
    }
    // Se o byte lido é \r, espera para ver se o próximo é \n
    if (byteRead == '\r') {
      waitingForLF = true;
      continue;
    }
    // Se o byte lido é \n (sem \r antes), processa normalmente
    if (byteRead == '\n') {
      processMessage(rxBuffer, rxLen);
      rxLen = 0;
      continue;
    }
  }

  // Fora do while: verifica timeout de receção
  if (rxLen > 0 && (millis() - variaveisMillisMV::rxStartTime > variaveisMillisMV::RX_TIMEOUT)) {  // Timeout: processa o que tem no buffer, mesmo sem terminação
    processMessage(rxBuffer, rxLen);
    rxLen = 0;
    waitingForLF = false;
  }
}

/**
 * @authors M.V. , Markus Sattler
 * @date 2025-08-27
 * @version 1.2
 * @brief Evento de tratamento da comunicação WebSocket.
 * Esta função é chamada sempre que ocorre um evento no WebSocket (conexão, desconexão, mensagem de texto, pong, erro). Permite gerir clientes
 * conectados, processar comandos específicos (como nome de utilizador ou palavra-passe de administrador), e responder conforme necessário.
 *
 * @param num ID do cliente WebSocket que gerou o evento.
 * @param type Tipo de evento WebSocket (conexão, mensagem, erro, etc.).
 * @param payload Ponteiro para os dados da mensagem recebida (se aplicável),para tratar deste tipo é necessário ter uma terminação "/0".
 * @param length Tamanho da mensagem recebida (em bytes).
 * 
 * @details
 * Esta função é chamada sempre que ocorre um evento no WebSocket (conexão, desconexão, mensagem de texto, pong, erro). Permite gerir clientes
 * conectados, processar comandos específicos (como nome de utilizador ou palavra-passe de administrador), e responder conforme necessário.
 * 
 * @todo USar o bin para receber os programas provindos do website para assim criar um modo para enviar programas para o robot.
 *
 * @see WStype_t in the file WebSocketsServer.h
 */
void webSocketEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t length) {
  /**
   * @fn conectarCliente(uint8_t num, IPAddress ip)
   * @brief Função auxiliar para conectar um cliente WebSocket.
   *
   * @param num ID do cliente.
   * @param ip Endereço IP do cliente.
   */
  auto conectarCliente = [](uint8_t num, IPAddress ip) {
    if (num < (WEBSOCKETS_SERVER_CLIENT_MAX - 1)) {
      clientManagerMV::clients[num].id = num;
      clientManagerMV::clients[num].ip = ip;
      clientManagerMV::clients[num].conectado = true;
      clientManagerMV::clients[num].startConnectionMillis = millis();
      updadeADMlist();  // Atualiza a lista do administrador, se houver
    }
    else {
      WARNING("Max clients reached, rejecting connection.");
    }
  };

  /**
   * @fn handleWebSocketMessage(uint8_t num, uint8_t *payload, size_t length)
   * @brief Função auxiliar para processar mensagens WebSocket recebidas.
   *
   * @param num ID do cliente que enviou a mensagem.
   * @param payload Ponteiro para os dados da mensagem recebida.
   * @param length Tamanho da mensagem recebida (em bytes).
   */
  auto handleWebSocketMessage = [](uint8_t num, uint8_t* payload, size_t length) {
    /**
     * @fn atualizarNomeCliente(uint8_t num, const char *newName)
     * @brief Actualiza o nome de um cliente na estrutura de clientes conectados. Esta função verifica se o ID é válido, se o cliente está
     * conectado e se o ponteiro para o novo nome não é nulo. Em seguida, copia o novo nome para a estrutura correspondente, garantindo que a string
     * esteja devidamente terminada.
     *
     * @param num ID do cliente .
     * @param newName Ponteiro para a nova string de nome a ser atribuída.
     */
    auto atualizarNomeCliente = [](uint8_t num, const char* newName) {
      if (num < WEBSOCKETS_SERVER_CLIENT_MAX && clientManagerMV::clients[num].conectado && newName != nullptr) {
        strncpy(clientManagerMV::clients[num].nome, newName, clientManagerMV::MAX_NOME_LENGTH - 1);
        clientManagerMV::clients[num].nome[clientManagerMV::MAX_NOME_LENGTH - 1] = '\0';  // Garante terminação
        updadeADMlist();
        DEBUG("Nome atualizado para cliente %u: %s\n", num, newName);
        enviarTextoParaCliente(num, "NOMEATUALIZADO");  // Envia confirmação de nome atualizado
      }
      else {
        ERRO("Its not possible to change the name: id=%u, conectado=%d, nome pointer=%p\n", num, clientManagerMV::clients[num].conectado, newName);
      }
    };

    using namespace clientManagerMV;
    const char* msg = (const char*)payload;  // Comando e argumentos

    // 1. Comandos de identificação
    if (length > 5 && strncmp(msg, "NOME:", 5) == 0) {
      atualizarNomeCliente(num, msg + 5);
      return;
    }
    if (length > 8 && strncmp(msg, "ADMPASS:", 8) == 0) {
      char senhaRecebida[32];
      strncpy(senhaRecebida, msg + 8, sizeof(senhaRecebida) - 1);
      senhaRecebida[31] = '\0';
      if (strcmp(senhaRecebida, ADMIN_PASSWORD) == 0 && adminCount < MAX_ADMIN) {
        clients[num].isAdmin = true;           // Concede o status de administrador ao cliente actual
        adminCount++;                          // Incrementa o contador de administradores ativos
        adminId = num;                         // Guarda o ID do cliente que se tornou administrador
        enviarTextoParaCliente(num, "ADMOK");  // Envia confirmação de sucesso na autenticação como administrador
        mostrarStatusClientes(adminId, 2);     // Actualiza a interface ou terminal com o novo estado dos clientes
      }
      else {
        enviarTextoParaCliente(num, adminCount >= MAX_ADMIN ? "ADMFULL" : "ADMFAIL");
      }
      return;
    }

    // 2. Comandos só para admin
    if (clients[num].isAdmin) {
      if (length == 10 && strncmp(msg, "CLIENTINFO", 10) == 0) {
        mostrarStatusClientes(num, 2);
        return;
      }
      if (length > 9 && strncmp(msg, "KICKUSER:", 9) == 0) {
        uint8_t idCliente = atoi(msg + 9);
        if (idCliente < WEBSOCKETS_SERVER_CLIENT_MAX && clients[idCliente].conectado) {
          desconectarCliente(idCliente, "KICKED");
          mostrarStatusClientes(num, 2);
          // PCEsp.printf("O cliente %u foi desconectado pelo admin %u.\n", idCliente, num);
        }
        else {
          enviarTextoParaCliente(num, "POPUP: ID inválido ou cliente não conectado.");
        }
        return;
      }
      if (length > 8 && strncmp(msg, "SETUSER:", 8) == 0) {
        uint8_t idCliente = atoi(msg + 8);
        if (idCliente < WEBSOCKETS_SERVER_CLIENT_MAX && clients[idCliente].conectado) {
          if (usercount < MAX_USER) {
            clients[idCliente].isUser = true;  // Define o cliente como usuário
            usercount++;                       // Incrementa o contador de usuários
            userId = idCliente;                // Guarda o ID do cliente que se tornou usuário
            enviarTextoParaCliente(idCliente, "USEROK");
            mostrarStatusClientes(adminId, 2);  // Mostra o status atualizado dos clientes
            DEBUG("O cliente %u foi definido como USER pelo admin %u.\n", idCliente, num);
          }
          else {
            enviarTextoParaCliente(num, "USERFULL");
          }
        }
        else {
          enviarTextoParaCliente(num, "POPUP:ID inválido ou cliente não conectado.");
        }
        return;
      }
      if (length > 11 && strncmp(msg, "REMOVEUSER:", 11) == 0) {
        uint8_t idCliente = atoi(msg + 11);
        if (idCliente < WEBSOCKETS_SERVER_CLIENT_MAX && clients[idCliente].conectado && clients[idCliente].isUser) {
          clients[idCliente].isUser = false;
          usercount--;
          userId = 255;
          enviarTextoParaCliente(idCliente, "USERREMOVED");
          mostrarStatusClientes(num, 2);
        }
        else {
          enviarTextoParaCliente(num, "POPUP:O cliente não é um usuário ou ID inválido.");
        }
        return;
      }
      if (length > 7 && strncmp(msg, "NEWSTA:", 7) == 0) {
        const char* data = msg + 7;
        const char* sep = strstr(data, "||");
        if (sep != NULL) {
          size_t ssid_len = sep - data;
          size_t pass_len = strlen(sep + 2);
          if (ssid_len < 64 && pass_len < 64) {
            char ssidSafe[64], passSafe[64];
            memcpy(ssidSafe, data, ssid_len);
            ssidSafe[ssid_len] = '\0';
            memcpy(passSafe, sep + 2, pass_len);
            passSafe[pass_len] = '\0';
            connectToSTA(ssidSafe, passSafe);
          }
          else {
            enviarTextoParaCliente(num, "POPUP: SSID ou password demasiado longos.");
          }
        }
        else {
          ERRO("THere is a problem with the logic of new STA in the main javaScript.");
        }
        return;
      }
      if (length == 11 && strncmp(msg, "GETREDEINFO", 11) == 0) {
        mostrarInfoRedeAtual(1);
        return;
      }
    }

    // 3. Mensagem comum
    VERBOSE("[Cliente %u] Mensagem: %s", num, msg);
    if (adminId != 255 && !clients[num].isAdmin) {  // Evia a mensagem do USER para o ADM.
      char buffer[robotValuesMV::MAX_MSG_LENGTH + 1];
      snprintf(buffer, sizeof(buffer), "SYS@[Cliente %u] %s", num, msg);
      enviarTextoParaCliente(adminId, buffer);
    }
    if (clients[num].isUser || clients[num].isAdmin) {
      if (startsWithIgnoreCase(payload, length, "show din")) {
        robotValuesMV::adicionarComandoNaFila(robotValuesMV::listType::COMMAND_TYPES,
            robotValuesMV::SHOW_DIN,
            nullptr,
            robotValuesMV::queueStartCBL,
            robotValuesMV::queueEndCBL,
            robotValuesMV::MAX_NUMBER_OF_COMMANDS_IN_QUEUE);
      }
      else if (startsWithIgnoreCase(payload, length, "show dout")) {
        robotValuesMV::adicionarComandoNaFila(robotValuesMV::listType::COMMAND_TYPES,
            robotValuesMV::SHOW_DOUT,
            nullptr,
            robotValuesMV::queueStartCBL,
            robotValuesMV::queueEndCBL,
            robotValuesMV::MAX_NUMBER_OF_COMMANDS_IN_QUEUE);
      }
      // Envio imediato para comandos críticos
      else if ((length == 2 && (startsWithIgnoreCase(payload, length, "A\r")))) {
        ESPMain.write("A");
        delay(10);
        ESPMain.write("\r");
        return;
      }
      else if ((length == 5 && (startsWithIgnoreCase(payload, length, "COFF\r")))) {
        // Envio imediato para COFF, letra a letra
        const char* cmd = "COFF\r";
        for (int i = 0; cmd[i] != '\0'; ++i) {
          ESPMain.write(cmd[i]);
          delay(10);  // ou o valor que preferir
        }
        //DEBUG("Comando crítico COFF enviado letra a letra: %s", cmd);
        return;
      }

      robotValuesMV::adicionarComandoNaFila(
          robotValuesMV::listType::CHAR_PM, robotValuesMV::commandType::NONE, msg, robotValuesMV::queueStartPM, robotValuesMV::queueEndPM, robotValuesMV::MAX_PENDING_MSGS);
      /*isto é para ignorar a lista de pendingmensages
      ESPMain.write((const uint8_t *)payload, strnlen((const char *)payload, length));  // Envia a mensagem recebida para o mainframe (ESPMain) no formato ASCII
      PCEsp.print("enviado para o mainframe (HEX): ");
      for (size_t i = 0; i < length; ++i) {
        if (payload[i] < 0x10) PCEsp.print('0');
        // Adiciona zero à esquerda para valores < 0x10
        PCEsp.print(payload[i], HEX);
        PCEsp.print(' ');
      }
      PCEsp.println();
      */
    }
  };

