Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
  // webSocket.sendPing(num);// Envia um ping ao conectar(não necessita)
  switch (type) {
    case WStype_ERROR: ERRO("Erro na comunicação WebSocket!"); break;
    case WStype_DISCONNECTED: desconectarCliente(num, "MANUAL"); break;
    case WStype_CONNECTED: conectarCliente(num, webSocket.remoteIP(num)); break;
    case WStype_TEXT: handleWebSocketMessage(num, payload, length); break;  // no maximo aguenta com (15.360 bytes) de uma vez [#define WEBSOCKETS_MAX_DATA_SIZE (15 * 1024)]
    case WStype_BIN:
      PCEsp.print("Mensagem binária recebida com tamanho: ");
      PCEsp.println(length);
      break;
    case WStype_FRAGMENT_TEXT_START: PCEsp.println("Início de fragmento de texto recebido.(parte inicial de um pedaço de texto)"); break;
    case WStype_FRAGMENT_BIN_START: PCEsp.println("Início de fragmento binário recebido.(parte inicial de um pedaço binário)"); break;
    case WStype_FRAGMENT: PCEsp.println("Fragmento recebido.(parte intermediária de um pedaço)"); break;
    case WStype_FRAGMENT_FIN: PCEsp.println("Fragmento final recebido.(parte final de um pedaço)"); break;
    case WStype_PING: DEBUG("Recebido PING do cliente: %u\n", num); break;
    case WStype_PONG:
      DEBUG("Recebido PONG do cliente: %u\n", num);  // Resposta de PONG recebida
      variaveisMillisMV::pongPending[num] = false;   // Marca o ping como respondido
      break;
    default: DEBUG("UNKNOWN event type: %u.", type); break;
  }
};

/**
 * @brief Envia uma mensagem de texto para um cliente específico. Verifica se o cliente está conectado e se o ponteiro da mensagem é válido antes de enviar a mensagem via WebSocket.
 * @param id ID do cliente .
 * @param texto Mensagem a ser enviada (string terminada em nulo).
 * 
 * @note
 * Inicios de String para desencadear uma função na interface web:
 * @p WARNING: Shows the text in the tab console.
 * @p POPUP: Show the string in a popup.
 * @p SYS@ Send to the terminal as a system mensage.
 */
void enviarTextoParaCliente(uint8_t id, const char* texto) {
  if (clientManagerMV::clients[id].conectado && texto) {
    webSocket.sendTXT(id, texto);
  }
}

// ativa a função que cria a tabela com os dados dos clientes, verifica se há um ADM
void updadeADMlist() {
  if (clientManagerMV::adminId != 255) {
    mostrarStatusClientes(clientManagerMV::adminId, 2);
  }
}

/**
 * @author M.V.
 * @date 2025-07-14
 * @version 1.0
 * @brief Verifica se o conteúdo do array `payload`(de tamanho 'length') começa com a string `prefix`, ignorando maiúsculas/minúsculas.
 *
 * @return `True` se corresponder, `False` caso contrário.
 */
bool startsWithIgnoreCase(const uint8_t* payload, size_t length, const char* prefix) {
  for (size_t i = 0; prefix[i] != '\0'; ++i) {  // Itera sobre cada carácter do prefixo
    if (i >= length) return false;              // Se o prefixo for maior que o payload, não pode havercorrespondência

    // Lê os caracteres correspondentes do payload e do prefixo
    char c1 = payload[i];
    char c2 = prefix[i];

    // Converte ambos para minúsculas manualmente (mais leve que tolower())
    if (c1 >= 'A' && c1 <= 'Z') c1 += 'a' - 'A';
    if (c2 >= 'A' && c2 <= 'Z') c2 += 'a' - 'A';
    if (c1 != c2) return false;  // Se os caracteres diferirem, a string não começa com o prefixo
  }
  return true;  // Todos os caracteres do prefixo coincidem (ignorando maiúsculas/minúsculas)
}

/**
 * @author M.V.
 * @date 2025-07-14
 * @version 1.1
 * @brief Desconecta um cliente e envia o motivo da desconexão. Esta função desconecta o cliente especificado, envia uma mensagem com o motivo da desconexão, encerra a conexão WebSocket e limpa os dados do cliente.
 *
 * @param id ID do cliente .
 * @param reason Motivo da desconexão (string terminada em nulo).
 */
void desconectarCliente(uint8_t id, const char* reason) {
  if (id < WEBSOCKETS_SERVER_CLIENT_MAX) {
    // Se o cliente era administrador, decrementa o contador
    if (clientManagerMV::clients[id].isAdmin && clientManagerMV::adminCount > 0) {
      clientManagerMV::adminCount--;
      clientManagerMV::adminId = 255;  // Nenhum administrador conectado
      DEBUG("AdminCount decrementado. Novo valor: %u\n", clientManagerMV::adminCount);
    }
    // se o cliente era utilizador, decrementa o contador
    if (clientManagerMV::clients[id].isUser && clientManagerMV::usercount > 0) {
      clientManagerMV::usercount--;
      clientManagerMV::userId = 255;  // Nenhum usuário conectado
      DEBUG("UserCount decrementado. Novo valor: %u\n", clientManagerMV::usercount);
    }

    // Envia mensagem com o motivo da desconexão (se ainda está ligado)
    if (webSocket.remoteIP(id)[0] != 0) {
      const char* prefixo = "DISCONNECTEDBY";
      char mensagem[25];
      snprintf(mensagem, sizeof(mensagem), "%s%s", prefixo, reason);
      enviarTextoParaCliente(id, mensagem);
    }
    DEBUG("O cliente %u foi desconectado pelo motivo: %s\n", id, reason);  // Exibe a mensagem de desconexão no console

    webSocket.disconnect(id);  // Encerra a conexão WebSocket do cliente
    delay(5);                  // Espera 1 ciclo para garantir encerramento (opcional, mas pode prevenir race conditions)

    // Reinicializa a estrutura do cliente
    clientManagerMV::clients[id] = clientManagerMV::Cliente();
    variaveisMillisMV::pongPending[id] = false;

    updadeADMlist();  // Atualiza a lista do administrador, se houver
  }
}

/**
 * @author M.V.
 * @date 2025-07-14
 * @version 1.1
 * @brief Função para verificar e desconectar clientes que ultrapassaram o tempo máximo de sessão. Esta função verifica periodicamente se algum cliente
 * conectado excedeu o tempo máximo de sessão. Se isso ocorrer, o cliente é desconectado automaticamente com o motivo "TIMEOUT".
 *
 * @note A função usa millis() para monitorar o tempo desde o início do programa.
 * @see desconectarCliente()
 */
void verificarTimeouts() {
  for (int i = 0; i < WEBSOCKETS_SERVER_CLIENT_MAX; i++) {
    if (clientManagerMV::clients[i].conectado) {
      // Verifica se o tempo de conexão ultrapassou o limite máximo
      if (variaveisMillisMV::agora - clientManagerMV::clients[i].startConnectionMillis > variaveisMillisMV::MAX_SESSION_TIME) {
        INFO("O cliente %u atingiu o tempo máximo de sessão.", i);
        desconectarCliente(i, "TIMEOUT");  // Desconecta o cliente após o tempo limite
      }
    }
  }
}

/**
 * @author M.V.
 * @date 2025-07-14
 * @version 1.1
 * @brief Verifica se os clientes estão realmente conectados via ping. Envia pings a cada 30 segundos para clientes conectados. Se não houver resposta (pong) em até 20 segundos,
 *  o cliente é desconectado com o motivo "NO_PONG".
 *
 * @details
 * - Atualiza `lastPingTime` e `lastPingMillis` de cada cliente.
 * - Marca pings pendentes com `pongPending[]`.
 * @note Chamado a cada 10s no loop principal. Não deve ser executado diretamente no loop.
 * @see webSocket.sendPing(), desconectarCliente()
 */
void clientsTrullyConected() {
  // Envia pings a cada 20 segundos
  if (variaveisMillisMV::agora - variaveisMillisMV::lastPingTime >= variaveisMillisMV::pingInterval) {
    variaveisMillisMV::lastPingTime = variaveisMillisMV::agora;
    for (int i = 0; i < WEBSOCKETS_SERVER_CLIENT_MAX; i++) {
      if (clientManagerMV::clients[i].conectado) {
        webSocket.sendPing(i);                                                  // Envia ping para o cliente
        variaveisMillisMV::pongPending[i] = true;                               // Marca o ping como pendente
        clientManagerMV::clients[i].lastPingMillis = variaveisMillisMV::agora;  // Atualiza o tempo do último ping
      }
    }
  }

