Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
  // Verifica se algum cliente não respondeu ao ping dentro de 10 segundos
  for (int i = 0; i < WEBSOCKETS_SERVER_CLIENT_MAX; i++) {
    if (clientManagerMV::clients[i].conectado && variaveisMillisMV::pongPending[i] &&
        (variaveisMillisMV::agora - clientManagerMV::clients[i].lastPingMillis > variaveisMillisMV::pongTimeout)) {
      INFO("Cliente %u não respondeu ao ping. A disconectar...\n", i);
      desconectarCliente(i, "NO_PONG");           // Desconecta o cliente
      variaveisMillisMV::pongPending[i] = false;  // Reseta o estado do ping
    }
    yield();
  }
}

/**
 * @author M.V.
 * @date 2025-07-14
 * @version 1.1
 * @brief Mostra o status de todos os clientes conectados.
 *
 * @param id ID do cliente (utilizado apenas quando o tipo de destino é 2, para enviar a mensagem via WebSocket).
 * @param target Tipo de destino:
 * @p 1: Envia o status para o Serial PC.
 * @p 2: Envia o status para o administrador via WebSocket.
 * @example
 *  `mostrarStatusClientes(255, 1);`  // Envia para o Serial PC
 *  `mostrarStatusClientes(1, 2);`    // Envia para o cliente ID 1 via WebSocket
 */
void mostrarStatusClientes(uint8_t id, uint8_t target) {
  using namespace clientManagerMV;
  constexpr size_t MAX_CLIENTS = WEBSOCKETS_SERVER_CLIENT_MAX;
  constexpr size_t CLIENT_INFO_LEN = 85;
  constexpr size_t BUFFER_TOTAL = 680;

  /**
   * @brief Formata o status de um cliente em uma string.
   * @param client Referência constante para o cliente a ser formatado. Usar referência garante acesso eficiente e evita a necessidade de checar ponteiro nulo.
   * @param buffer Buffer de destino onde a string formatada será armazenada.
   * @param bufferSize Tamanho máximo do buffer fornecido (inclui o caractere nulo).
   * @details
   * A string gerada inclui: ID, IP, status de admin/user, nome e tempo de conexão (hh:mm:ss). Exemplo de saída: "ID:1|192.168.1.10|Sim|Não|João|00:12:34\n"
   */
  auto formatarStatusCliente = [](const clientManagerMV::Cliente& client, char* buffer, size_t bufferSize) {
    unsigned long tempoConexao = millis() - client.startConnectionMillis;
    unsigned long horas = tempoConexao / 3600000;
    unsigned long minutos = (tempoConexao % 3600000) / 60000;
    unsigned long segundos = (tempoConexao % 60000) / 1000;
    snprintf(buffer,
        bufferSize,
        "ID:%u|%s|%s|%s|%s|%02lu:%02lu:%02lu\n",
        client.id,
        client.ip.toString().c_str(),
        client.isAdmin ? "Sim" : "Não",
        client.isUser ? "Sim" : "Não",
        client.nome,
        horas,
        minutos,
        segundos);
  };

  switch (target) {
    case 1: {  // Serial PC
      PCEsp.println(F("---- Status dos Clientes ----"));
      PCEsp.println(F("ID | IP | Admin | User | Nome | Conectado à:"));
      for (uint8_t i = 0; i < MAX_CLIENTS; i++) {
        if (!clients[i].conectado) continue;
        char linha[CLIENT_INFO_LEN];
        formatarStatusCliente(clients[i], linha, sizeof(linha));
        PCEsp.print(linha);
      }
      PCEsp.println(F("-------------------------------"));
      break;
    }
    case 2: {  // Enviar para ADM
      char mensagemTotal[BUFFER_TOTAL] = {0};
      size_t mensagemLen = 0;

      for (uint8_t i = 0; i < MAX_CLIENTS; i++) {
        ledRGB(0, 0, 100);
        if (!clients[i].conectado) {
          ledRGB(0, 0, 0);
          continue;
        }

        char clienteInfo[CLIENT_INFO_LEN];
        formatarStatusCliente(clients[i], clienteInfo, sizeof(clienteInfo));
        size_t infoLen = strlen(clienteInfo);
        if (mensagemLen + infoLen >= BUFFER_TOTAL) {
          enviarTextoParaCliente(id, mensagemTotal);
          mensagemLen = 0;
          mensagemTotal[0] = '\0';
        }
        memcpy(mensagemTotal + mensagemLen, clienteInfo, infoLen);
        mensagemLen += infoLen;
        mensagemTotal[mensagemLen] = '\0';
        ledRGB(0, 0, 0);
      }
      if (mensagemLen > 0) {
        enviarTextoParaCliente(id, mensagemTotal);
      }
      break;
    }
  }
}

/**
 * @author M.V.
 * @date 2025-08-27
 * @version 2.0
 * @brief It serves to connect to a STA network.
 *
 * @attention While searching for a network, the system will stop in a loop, so be carefull when changing the STA.
 * @param ssid Nome da rede.
 * @param password Password da rede.
 * */
void connectToSTA(const char* ssid, const char* password) {
  if (!ssid || !password) {
    enviarTextoParaCliente(clientManagerMV::adminId, "WARNING:SSID ou password nulos.");
    return;
  }
  // Copiar credenciais para buffers seguros
  char ssidSafe[64], passSafe[64];
  strncpy(ssidSafe, ssid, sizeof(ssidSafe) - 1);
  ssidSafe[sizeof(ssidSafe) - 1] = '\0';
  strncpy(passSafe, password, sizeof(passSafe) - 1);
  passSafe[sizeof(passSafe) - 1] = '\0';

  // Mantém o AP ativo sempre, só mexe na STA
  WiFi.mode(WIFI_AP_STA);
  WiFi.begin(ssidSafe, passSafe);

  INFO("Connecting to the network: %s ...", ssidSafe);
  enviarTextoParaCliente(clientManagerMV::adminId, "POPUP:ESP:A ligar à nova rede STA...");
  enviarTextoParaCliente(clientManagerMV::adminId, "POPUP:As informações de status irão aparecer na DevTool desta página.");

  uint32_t start = millis();
  bool connected = false;

  // Espera X ms antes de desistir
  while (WiFi.status() != WL_CONNECTED && millis() - start < (variaveisMillisMV::pongTimeout - 4500UL)) {
    delay(480);
    PCEsp.print(".");
  }

  connected = (WiFi.status() == WL_CONNECTED);

  if (connected) {
    ledRGB(0, 50, 0);
    char avisoLigacaoSTA[128];
    snprintf(avisoLigacaoSTA, sizeof(avisoLigacaoSTA), "WARNING:Conectado a %s com sucesso! IP (STA): %s", WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());

    INFO("%s", avisoLigacaoSTA);
    enviarTextoParaCliente(clientManagerMV::adminId, avisoLigacaoSTA);
  }
  else {
    WARNING("\n❌Timeout reached to connect to the STA network.");
    enviarTextoParaCliente(clientManagerMV::adminId, "WARNING:Não foi possível ligar à rede STA. Mas o AP continua ativo.");

    ledRGB(50, 50, 50);

    // Desliga apenas a STA, mantém AP ativo
    WiFi.disconnect(true, false);
    WiFi.mode(WIFI_AP);  // deixa só AP ligado, para evitar spam de reconexões
  }
}

/**
 * @author M.V.
 * @date 2025-07-14
 * @version 1.0
 * @brief Manda infromação sobre os modos de rede do ESP.
 *
 * @param target (0 = Serial | 1 = WebSocket) */
void mostrarInfoRedeAtual(uint8_t target) {
  switch (target) {
    case 0: {  // Serial
      PCEsp.println(F("📶 Informações da ligação de rede actual:\n"));
      if (WiFi.getMode() & WIFI_STA && WiFi.isConnected()) {
        PCEsp.println(F("🟢 Ligado como STA (cliente):"));
        PCEsp.printf("    SSID: %s\n", WiFi.SSID().c_str());
        PCEsp.printf("    BSSID: %s\n", WiFi.BSSIDstr().c_str());
        PCEsp.printf("    RSSI: %d dBm\n", WiFi.RSSI());
        PCEsp.printf("    Canal: %d\n", WiFi.channel());
        PCEsp.printf("    IP Local: %s\n", WiFi.localIP().toString().c_str());
        PCEsp.printf("    Gateway: %s\n", WiFi.gatewayIP().toString().c_str());
        PCEsp.printf("    DNS: %s\n", WiFi.dnsIP().toString().c_str());
        PCEsp.printf("    MAC do ESP: %s\n", WiFi.macAddress().c_str());
      }
      else {
        PCEsp.println(F("🔴 Não está ligado a nenhuma rede como STA."));
      }

      if (WiFi.getMode() & WIFI_AP) {
        PCEsp.println(F("\n📡 A funcionar como ponto de acesso (AP):"));
        PCEsp.printf("    SSID AP: %s\n", WiFi.softAPSSID().c_str());
        PCEsp.printf("    IP do AP: %s\n", WiFi.softAPIP().toString().c_str());
        PCEsp.printf("    MAC AP: %s\n", WiFi.softAPmacAddress().c_str());
      }
      break;
    }
    case 1: {  // WebSocket
      char infoWiFi[400];
      infoWiFi[0] = '\0';

