Mestre-Verde/scorbot-er-vii-esp32-webcontrol/src/main.cpp
      if (WiFi.getMode() & WIFI_STA && WiFi.isConnected()) {
        snprintf(infoWiFi + strlen(infoWiFi),
            sizeof(infoWiFi) - strlen(infoWiFi),
            "WARNING:Ligado como STA (cliente)\nSSID: %s\nBSSID: "
            "%s\nRSSI: %d dBm\nCanal: %d\nIP Local: %s\nGateway: %s\nDNS: "
            "%s\nMAC do ESP: %s\n",
            WiFi.SSID().c_str(),
            WiFi.BSSIDstr().c_str(),
            WiFi.RSSI(),
            WiFi.channel(),
            WiFi.localIP().toString().c_str(),
            WiFi.gatewayIP().toString().c_str(),
            WiFi.dnsIP().toString().c_str(),
            WiFi.macAddress().c_str());
      }
      else {
        snprintf(infoWiFi + strlen(infoWiFi), sizeof(infoWiFi) - strlen(infoWiFi), "WARNING:Não está ligado a nenhuma rede como STA.\n");
      }

      if (WiFi.getMode() & WIFI_AP) {
        snprintf(infoWiFi + strlen(infoWiFi),
            sizeof(infoWiFi) - strlen(infoWiFi),
            "WARNING:A funcionar como ponto de acesso (AP)\nSSID AP: "
            "%s\nIP do AP: %s\nMAC AP: %s\n",
            WiFi.softAPSSID().c_str(),
            WiFi.softAPIP().toString().c_str(),
            WiFi.softAPmacAddress().c_str());
      }

      enviarTextoParaCliente(clientManagerMV::adminId, infoWiFi);
      break;
    }
  }
}
/*
void listarRedesWiFi() {
  PCEsp.println(F("🔍 A procurar redes Wi-Fi próximas..."));
  int numRedes = WiFi.scanNetworks(false, true);  // async=false,
  bool show_hidden = true;

      if (numRedes == 0) {
    PCEsp.println(F("❌ Nenhuma rede encontrada."));
  }
  else {
    PCEsp.printf("✅ %d redes encontradas:\n\n", numRedes);

    for (int i = 0; i < numRedes; i++) {
      String ssid = WiFi.SSID(i);
      String bssid = WiFi.BSSIDstr(i);
      int rssi = WiFi.RSSI(i);
      int canal = WiFi.channel(i);
      wifi_auth_mode_t auth = WiFi.encryptionType(i);

      // Banda e frequência
      const char* banda = (canal > 13) ? "5 GHz" : "2.4 GHz";
      int freqMHz = (canal <= 14) ? (2407 + canal * 5) : (5000 + canal * 5);

      PCEsp.printf("📡 [%d] SSID: %s\n", i + 1, ssid.c_str());
      PCEsp.printf("    BSSID: %s\n", bssid.c_str());
      PCEsp.printf("    RSSI: %d dBm\n", rssi);
      PCEsp.printf("    Canal: %d (%s)\n", canal, banda);
      PCEsp.printf("    Frequência: %d MHz\n", freqMHz);
      PCEsp.printf("    Encriptação: %s\n\n", traduzirEncriptacao(auth));
    }
  }
  WiFi.scanDelete();
}
const char* traduzirEncriptacao(wifi_auth_mode_t tipo) {
  switch (tipo) {
    case WIFI_AUTH_OPEN: return "Nenhuma";
    case WIFI_AUTH_WEP: return "WEP";
    case WIFI_AUTH_WPA_PSK: return "WPA";
    case WIFI_AUTH_WPA2_PSK: return "WPA2";
    case WIFI_AUTH_WPA_WPA2_PSK: return "WPA/WPA2";
    case WIFI_AUTH_WPA2_ENTERPRISE: return "WPA2 Enterprise";
    case WIFI_AUTH_WPA3_PSK: return "WPA3";
    case WIFI_AUTH_WPA2_WPA3_PSK: return "WPA2/WPA3";
    case WIFI_AUTH_WAPI_PSK: return "WAPI";
    default: return "Desconhecido";
  }
}
*/
/*
Tipos básicos em C/C++ (tamanhos e intervalos típicos):

int8_t       : 1 byte            : -128 a 127     (inteiro com sinal 8 bits) 
uint8_t      : 1 byte            : 0 a 255 (inteiro sem sinal 8bits) 
char         : 1 byte            : -128 a 127 (signed) ou 0 a 255(unsigned) dependendo do compilador 
int16_t      : 2 bytes           : -32.768 a 32.767            (inteiro com sinal 16 bits) 
uint16_t     : 2 bytes            : 0 a 65.535                  (inteiro sem sinal 16 bits) 
short        : 2 bytes            :geralmente igual a int16_t 
int          : 4 bytes           : -2.147.483.648 a 2.147.483.647 (inteiro com sinal 32 bits) 
unsigned int : 4 bytes           : 0 a 4.294.967.295           (inteiro sem sinal 32 bits) 
long         : 4 ou 8 bytes (depende da plataforma) 
int64_t      : 8 bytes           : -9.223.372.036.854.775.808 a 9.223.372.036.854.775.807 (inteiro com sinal 64bits) 
uint64_t     : 8 bytes           : 0 a 18.446.744.073.709.551.615 (inteiro sem sinal 64 bits) 
float        : 4 bytes           : ± ~3.4×10³⁸ (6-7 dígitos de precisão) (ponto flutuante simples) 
double       : 8 bytes           : ±~1.8×10³⁰⁸ (15 dígitos de precisão)   (ponto flutuante dupla) 
long double  : 8,12 ou 16 bytes (depende da plataforma e compilador) (precisão estendida) 
bool :1 byte            : true (1) ou false (0)        (valor lógico) 
size_t       : 4 ou 8 bytes (depende da arquitetura)  (tipo para tamanhos e índices, sempre positivo)

Observações:
- O tamanho exato pode variar conforme arquitetura e compilador.
- Tipos fixos como int8_t, uint16_t etc. garantem tamanho definido, incluídos em
<stdint.h> ou <cstdint>.
- Use unsigned para valores sempre positivos.
- Para tamanhos e índices, prefira usar size_t.

"volatile"
A palavra-chave volatile informa ao compilador que a variável pode ser
modificada a qualquer momento fora do fluxo do programa atual, por exemplo: por
uma interrupção (ISR); por uma thread diferente (em sistemas com RTOS); por
acesso direto ao hardware (registradores); por DMA (acesso direto à memória).
Quando uma variável é volatile, o compilador não pode otimizá-la (por exemplo,
armazenar o valor em registradores ou assumir que não muda entre leituras
consecutivas).

for (inicialização ; condição ; incremento) {
    // corpo do loop
}

pagina web = PT, debug = EN
*/